"""
剛剛睡了一覺 想了很多
我不知道該怎麼辦才能脫離當前的困境

我喜歡開發也喜歡寫程式
但我發現這份工作真的帶給我很大的壓力
剛剛仔細想了一下不斷積累且無法排解壓力根源的原因

當一件工作還沒完成時 我會想要盡快完成需求 然後通常會努力了很久結果卻不盡人意
這時候我會陷入焦慮(可能睡覺時都還掛一份心想著問題解到哪裡、明天要怎麼詢問、開會時要怎麼交代進度)
然後會更急著想把事情做完 進而引發更多錯誤
或是當需求急切 我又不知道從何下手時 會有很強烈的無助感
需求一個接著一個 上一次的壓力還不得喘息就又緊接著下一次的難題
導致我沒有太多時間去享受原本很感興趣的事物 或是留一點時間給自己沈澱
我的心情也會隨著目前手上是否有未完成的工作而有很強烈的起伏

近期完成需求時的開心豁然與成就感
似乎已經無法支撐相對長時間面對的壓力
這也許是壓力不斷積累且無法排除的原因

然而目前的我依舊還沒有辦法很妥善的切割出休息的時間
就算強迫自己在下班時間從事有興趣的事
總還是懸著一顆心在未完成的工作上 甚至會加劇事情還沒處理完的擔憂
然後就又會進入 想趕快做完 -> 做不好 -> 難過 -> 害怕下一個需求 的惡性循環

想問問寶貝有沒有什麼好的想法可以解決當前的問題
"""

"""
一、引發焦慮的根源
1.想盡快完成，不盡人意 -> 產生焦慮 -> 更急著想完成 -> 粗心導致錯誤卡住腳步遲遲無法完成 -> 產生更多焦慮
2.一個需求下來，完全看不懂時 -> 找不到切入點或是對於整體架構的不明白 -> 找一個人問整體架構(功能入口or接口處)
3.上個需求的心情還沒平復，下個需求接著出現，陷入新的困境 -> 焦慮無法排解

二、無法妥善切換心情
1.工作未完成，即便到了下班也無法放下心休息 -> 真的放不下就做完它  # 我自己以前也是會寫到半夜XD


針對引發焦慮根源的討論：
問題討論一：想盡快完成需求，努力了很久結果卻不盡人意(問題解到哪、明天怎麼問、開會怎麼交代)。 -> 引發焦慮
我的理解：對於手上當前工單，由於不知道怎麼樣算是「完成」，表示看不到目標地，即因爲看不到目標而引發的焦慮。
== 須先確認上述認知是否正確，再進行下方提議 ==
規劃一套屬於自己的工作流程與架構
流程範例:
 - 確認需求：與PM核對功能的條件與行為。
 - 理解程式碼架構與相關規範：找人問入口、功能與邏輯。
 - 找到需求所在處進行開發：理解大概程式架構後。
   1.能知道自己在哪。
   2.能知道自己的需求是在架構的哪個位置。
規劃流程有以下好處：
1.設立目標。
2.進度點明確、易掌控。
3.提前知道會用到什麼工具，可以知道自己是否會用，若不會用的話需要在哪裡觀摩。
寶貝已經有自己的架構，可以試著仙草你自己的想法，接著拿著想法各方詢問好得出最終結論，最後再開始動工。
1.節省時間
2.想法已經經過Senior確認、調整，通關率高

問題討論二：當需求急切，我又不知道從何下手時，會有很強烈的無助感。
完全不得其門而入時，問問資深同仁該需求的具體邏輯、架構，讓自己了解身在何方、本次需求在何方，完全掌握後再遵照自己的開發流程走。

問題討論三：會更急著想把事情做完，進而引發更多錯誤。
電腦運作的時候只有電腦自己知道在幹啥，我們人類要知道的兩個途徑
1.程式中斷點
2.print or logger.info

=== 寶貝加油！ ===
"""